In [4]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt

csvpath = os.path.join('..','Resources','city_data.csv')
csvpath2 = os.path.join('..','Resources','ride_data.csv')

city = pd.read_csv(csvpath)
ride =pd.read_csv(csvpath2)

In [5]:
city.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [6]:
ride.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2018-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2018-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2018-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2018-02-10 23:22:03  23.44  5149245426178
4          South Jack  2018-03-06 04:28:35  34.58  3908451377344

In [24]:
## merge the two csv
test = pd.merge(city, ride, on='city')
test.sort_values('city', ascending=True).head()

,city,driver_count,type,date,fare,ride_id
1523,Amandaburgh,12,Urban,2018-01-11 02:22:07,29.24,7279902884763
1522,Amandaburgh,12,Urban,2018-02-10 20:42:46,36.17,6455620849753
1529,Amandaburgh,12,Urban,2018-03-13 12:52:31,13.88,6222134922674
1524,Amandaburgh,12,Urban,2018-01-21 04:12:54,9.26,5528427024492
1525,Amandaburgh,12,Urban,2018-04-19 16:30:12,6.27,4400632718421

In [12]:
grouped_data = test.groupby('city')
grouped_data['fare'].mean().head()

city
Amandaburgh      24.641667
Barajasview      25.332273
Barronchester    36.422500
Bethanyland      32.956111
Bradshawfurt     40.064000
Name: fare, dtype: float64

In [14]:
grouped_data.count().head()

               driver_count  type  date  fare  ride_id
city
Amandaburgh              18    18    18    18       18
Barajasview              22    22    22    22       22
Barronchester            16    16    16    16       16
Bethanyland              18    18    18    18       18
Bradshawfurt             10    10    10    10       10

In [26]:
x=grouped_data['driver_count'].sum()/grouped_data['driver_count'].count()
x.head()

city
Amandaburgh      12.0
Barajasview      26.0
Barronchester    11.0
Bethanyland      22.0
Bradshawfurt      7.0
Name: driver_count, dtype: float64